tech-grandpa/spooldex-humidity-tracker/firmware/sdkconfig.defaults
# ESP32-C6 target
CONFIG_IDF_TARGET="esp32c6"

# BLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n

# WiFi
CONFIG_ESP_WIFI_MODE_STA=y

# MQTT
CONFIG_MQTT_PROTOCOL_311=y

# Power management
CONFIG_PM_ENABLE=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
